## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,52 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.resource_group.azurerm_management_lock.resource-group-level[0] will be created
+  + resource "azurerm_management_lock" "resource-group-level" {
+      + id         = (known after apply)
+      + lock_level = "CanNotDelete"
+      + name       = "rg-lock-example-test-neu"
+      + notes      = "This Resource Group is locked by terrafrom"
+      + scope      = (known after apply)
+    }
+
+  # module.resource_group.azurerm_resource_group.default[0] will be created
+  + resource "azurerm_resource_group" "default" {
+      + id       = (known after apply)
+      + location = "northeurope"
+      + name     = "rg-example-test-neu"
+      + tags     = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "example-test-neu"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-resource-group"
+        }
+
+      + timeouts {
+          + create = "90m"
+          + delete = "90m"
+          + read   = "5m"
+          + update = "90m"
+        }
+    }
+
+Plan: 2 to add, 0 to change, 0 to destroy.
+
+Changes to Outputs:
+  + resource_group_id       = (known after apply)
+  + resource_group_location = "northeurope"
+  + resource_group_name     = "rg-example-test-neu"
+  + tags                    = {
+      + Business_unit   = "corp"
+      + Deployment_mode = "terraform"
+      + Environment     = "test"
+      + Managedby       = "terraform-az-modules"
+      + Name            = "example-test-neu"
+      + Repository      = "https://github.com/terraform-az-modules/terraform-azure-resource-group"
+    }

```

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-resource-group/actions/runs/15213194585)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->